package cn.vetech.center.usecar.common.code;

import org.vetech.core.api.Code;

/**
 * Created by vetech on 2017/9/5.
 * 用车订单错误代码
 *
 * 用车的错误代码以 UCAR开头 不得重复
 * @author houya
 */
public enum UsecarOrderCode implements Code {
    /**
     * 通用异常
     */
    UCAR_CPSA_ERROR("UCAR_10000", "%s"),
    /**
     *
     */
    UCAR_10001("UCAR_10001", "下单失败"),
    /**
     *
     */
    UCAR_10002("UCAR_10002", "采购商户编号为空！"),
    /**
     *
     */
    UCAR_10003("UCAR_10003", "供应商户编号为空"),
    /**
     *
     */
    UCAR_10004("UCAR_10004", "查询正常单订单列表异常"),
    /**
     *
     */
    UCAR_10005("UCAR_10005", "查询采购正常单订单列表数量异常"),
    /**
     *
     */
    UCAR_10006("UCAR_10006", "查询供应正常单订单列表数量异常"),
    /**
     *
     */
    UCAR_10007("UCAR_10007", "根据订单编号%s查询对应订单异常"),
    /**
     *查询产品异常
     */
    UCAR_10008("UCAR_10008", "查询产品异常"),
    /**
     *
     */
    UCAR_10009("UCAR_10009", "已支付订单不能取消"),
    /**
     *
     */
    UCAR_10010("UCAR_10010", "请求CPS取消订单失败:%s"),
    /**
     *
     */
    UCAR_10011("UCAR_10011", "请求CPS采购服务完成失败:%s"),
    /**
     *
     */
    UCAR_10012("UCAR_10012", "请求CPS采购申请退款失败:%s"),
    /**
     *
     */
    UCAR_10013("UCAR_10013", "请求CPS供应确认订单失败:%s"),
    /**
     *
     */
    UCAR_10014("UCAR_10014", "请求CPS供应确认服务完成失败:%s"),
    /**
     *
     */
    UCAR_10015("UCAR_10015", "请求CPS供应退款单退单审核接口失败:%s"),
    /**
     *
     */
    UCAR_10016("UCAR_10016", "请求CPS供应拒单接口失败:%s"),
    /**
     *
     */
    UCAR_10017("UCAR_10017", "请求CPS供应派车或改派车接口失败:%s"),
    /**
     *
     */
    UCAR_10018("UCAR_10018", "查询认证站点的产品类型id为空"),
    /**
     *
     */
    UCAR_10019("UCAR_10019", "查询认证站点的称城市站点id为空"),
    /**
     *
     */
    UCAR_10020("UCAR_10020", "请求CPS查询服务标准、服务内容、授权站点异常"),
    /**
     *
     */
    UCAR_10021("UCAR_10021", "根据订单编号%s没有查询到对应的分账信息数据"),
    /**下单时缓存等待超时**/
    UCAR_20007("UCAR_10009","因页面停留时间过长未能成功下单，请在查询后10分钟内下单"),
    /**
     *
     */
    UCAR_10031("UCAR_10031", "未授权，请联系管理员授权"),
    /**
     * 查询车型组信息失败
     */
    UCAR_CDS_FAIL("UCAR_30006","查询车型组信息失败"),
    /**价格缓存失效,请重新查询*/
    HCSX("UCAR_20002", "价格缓存失效,请重新查询"),

    /**
     * 查询产品供应商信息失败
     */
    UCAR_30007("UCAR_30007","查询产品供应商信息失败"),
    /**
     * 查询产品缓存价格失败
     */
    UCAR_30008("UCAR_30008","产品价格缓存异常"),

    /**
     * 查询产品缓存价格失败
     */
    UCAR_30009("UCAR_30009","用车专快车下单参数异常"),
    /**
     * 订单更新异常
     */
    ORDER_UPDATE_000001("ORDER_UPDATE_000001","订单更新异常，请检查"),
    /**
     * 下单到供应商失败
     */
    UCAR_30010("UCAR_30010","用车专快车下单到供应商异常"),

    /**
     * 下单相关
     */
    CAREATEORDER_WBDD_BAD502("-502","ASMS下单请求参数异常:%s。"),
    /**
     * xml格式问题
     */
    XMLFORMAT_ERROR("XML_ERROR","XML格式不合法！"),
    /**
     * 下单到供应商失败
     */
    UCAR_30011("UCAR_30011","用车接送下单到供应商异常"),
    /**
     * 接口供应商退款异常
     */
    UCAR_30012("UCAR_30012","用车接口供应商退款异常"),
    /**
     * 接口供应商退款异常
     */
    UCAR_30013("UCAR_30013","用车申请退款根据缓存id查询异常"),
    /**
     * 接口供应商退款异常
     */
    UCAR_30014("UCAR_30014","用车预取消调用link返回null异常"),
    /**
     * 接口供应商退款异常
     */
    UCAR_30015("UCAR_30015","用车调用link取消失败"),
    /****/
    UCAR_30016("UCAR_30016","CPS订单编号未传入，放弃订单同步请求！"),
    /****/
    UCAR_30017("UCAR_30017","订单状态为已拒单不能进行申请退款操作!"),
    /****/
    UCAR_30019("UCAR_30019","用车评价投诉订单主数据为空！"),
    UCAR_30020("UCAR_30020","当前订单状态不支持取消！"),
    /**
     * 图片字符节数量和图片链接数不同
     */
    UCAR_30021("UCAR_30021","图片字符节数量和图片链接数不同"),
    /****/
    UCAR_30101("UCAR_30101","存在%s子单待退款"),
    /****/
    UCAR_30102("UCAR_30101","存在%s子单待分账"),
    /**
     * 文件上传失败
     */
    UCAR_30022("UCAR_30022","文件上传失败"),
    /***/
    UCAR_30018("UCAR_30018","确认叫车失败:%s"),


    UCAR_30220("UCAR_30220","%s已经存在其他分类"),
    /**
     *
     */
    UCAR_30221("UCAR_30221", "企业未支付订单超过上限，请及时付款后下单"),
    /**
     *
     */
    UCAR_30222("UCAR_30222", "您有一个未支付订单，请及时支付后在用车"),
    /**
     *查询产品异常
     */
    UCAR_30223("UCAR_30223", "查询产品异常,渠道账户未匹配到供应商"),
    /**
     * 系统异常
     */
    UCAR_30224("UCAR_30224", "系统异常"),
    ;

    /**
     * 错误代码
     */
    private String code;

    /**
     * 错误信息
     */
    private String message;

    UsecarOrderCode(String code, String message) {
        this.code = code;
        this.message = message;
    }

    @Override
    public String getCode() {
        return code;
    }

    @Override
    public String getMessage() {
        return message;
    }
}